Revit 2027 API
RebarShapeDrivenAccessor.GetDistributionPath Method
 The distribution path of a rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Line GetDistributionPath()
Public Function GetDistributionPath As Line
public:
Line^ GetDistributionPath()
member GetDistributionPath : unit -> Line
Return Value
Line
 A line beginning at (0, 0, 0) and representing the direction and length of the set.
Exceptions
Exception | Condition
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace